[net]
batch=128
subdivisions=1
height=64
width=64
crop_height=56
crop_width=56
channels=3
learning_rate=0.00001
momentum=0.9
decay=0.0005

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[connected]
output=2048
activation=relu

[dropout]
probability=.5

[connected]
output=2048
activation=relu

[dropout]
probability=.5

[connected]
output=200
activation=linear


